# Command line tools
brew 'ata' # Command line tool for ATA (Advanced Technology Attachment) devices
brew 'cask' # Extension to brew supporting installation of graphical applications
brew 'ffmpeg' # Complete solution to record, convert and stream audio and video
brew 'gh' # GitHub's official command line tool
brew 'git' # Distributed version control system
brew 'htop' # Interactive process viewer, an enhanced version of top
brew 'imagemagick' # Command-line tool for manipulating images
brew 'mailsy' # Command-line email client or email utility
brew 'mas' # Mac App Store command-line interface
brew 'mpv' # Free, open-source media player
brew 'neovim' # Hyperextensible Vim-based text editor
brew 'node' # JavaScript runtime environment
brew 'numpy' # Python library for numerical computing
brew 'python' # Programming language interpreter
brew 'speedtest-cli' # Command-line interface for testing internet bandwidth
brew 'wifi-password' # Utility to get the password of the current WiFi network
brew 'yt-dlp' # YouTube video downloader, fork of youtube-dl with additional features

# Applications
cask '1password' # Password manager and secure digital vault
cask 'appcleaner' # Tool to uninstall unwanted apps completely
cask 'arc' # Chromium-based browser with unique tab management
cask 'bartender' # Menu bar icon organizer
cask 'claude' # Native desktop application for Claude AI
cask 'clay' # Relationship management tool
cask 'cursor' # Code editor with AI capabilities, based on VSCode
cask 'daisydisk' # Disk space analyzer and cleaner
cask 'descript' # All-in-one audio/video editing software
cask 'discord' # Voice, video, and text chat platform
cask 'ghostty' # Modern, GPU-accelerated terminal emulator
cask 'granola' # Energy usage optimization tool
cask 'limitless' # Productivity app for macOS
cask 'linear-linear' # Project management and issue tracking tool
cask 'logi-options+' # Mouse and keyboard customization for Logitech devices
cask 'loom' # Screen recording and video sharing tool
cask 'macwhisper' # Transcription app using OpenAI's Whisper model
cask 'mochi' # Spaced repetition flashcard app
cask 'notion' # All-in-one workspace for notes, tasks, wikis, and databases
cask 'notion-calendar' # Calendar app integrated with Notion
cask 'numi' # Calculator app with natural language processing
cask 'ollama' # Local large language model runner
cask 'poe' # AI chat client for multiple models
cask 'postman' # API development environment
cask 'raindropio' # Bookmark manager
cask 'raycast' # Productivity tool and application launcher
cask 'rewind' # Time machine for your computer activity
cask 'rize' # Time tracking and productivity app
cask 'rode-connect' # Software for RØDE microphones and audio devices
cask 'screen-studio' # Screen recording and editing software
cask 'shortcat' # Keyboard productivity tool for navigating macOS
cask 'slack' # Team communication and collaboration platform
cask 'spotify' # Music streaming service
cask 'streamlabs' # Streaming software for live broadcasts
cask 'superhuman' # Email client with advanced features
cask 'thingsmacsandboxhelper' # Helper app for Things task manager
cask 'visual-studio-code' # Source code editor by Microsoft
cask 'windsurf' # Customizable window manager
cask 'zoom' # Video conferencing tool

# Mac App Store Applications
mas 'Bear', id: 1091189122 # Markdown notes app with advanced organization
mas 'Drafts', id: 1435957248 # Text capture and note-taking app
mas 'Kindle', id: 302584613 # E-book reader from Amazon
mas 'LINE', id: 539883307 # Messaging and voice call app
mas 'One Thing', id: 1604176982 # Minimal to-do app focused on single tasks
mas 'Perplexity', id: 6714467650 # AI-powered search and answer engine
mas 'Things', id: 904280696 # Task manager and to-do list app